<template>
  <q-page padding>

    <div class="q-pa-md">
      <h5 class="text-h5 text-black q-my-md mt-0">Про проект <b>"Мій сад"</b></h5>
      <p>
        Проект націлений, в першу чергу, на садівників аматорів, які захоплені вирощуванням рослин.
      </p>
      <p>
        У таких людей на садових ділянках розташовуються колекції рослин, які вони збирали багато років.
      </p>
      <p>
        Переважна більшість садівників не володіють ресурсами, щоб створити власний сайт.
      </p>
      <p>
        Багато хто з таких людей ніде не виставляють свої рослини, і таких ентузіастів не просто знайти.
      </p>
      <p>
        Зазвичай, це відбувається по залишених коментарях: під постами, в групах відповідної тематики на facebook, під відео на youtube та інших ресурсах.
      </p>
      <p>
        Вишукуючи контакти через спільних друзів – людей, знайдених подібним чином на тому ж facebook.
      </p>
      <p>
        У разі нашого сайту їм самим буде цікаво створювати базу даних своїх рослин і користуватися сайтом, в тому числі завдяки зручному інтерфейсу, можливості вести записи і зв'язуватися з власниками садів для придбання рослин.
      </p>
      <p>
        У них, як правило, є надлишки посадкового матеріалу, і вони будуть раді, якщо про рослини, які їх цікавлять, дізнається велика кількість людей.
      </p>
      <p>
        Новачки зможуть з легкістю знаходити таких людей і купувати у них рослини.
      </p>
      <p>
        І ще важливіше, досвід, тримаючи зв'язок за залишеними контактами.
      </p>
    </div>

    <q-page-scroller position="bottom-right" :scroll-offset="150" :offset="[18, 18]">
      <q-btn fab icon="keyboard_arrow_up" color="black" />
    </q-page-scroller>

  </q-page>
</template>

<script>
export default {
  name: 'About'
}
</script>

<style scoped>
.pb-10 {
  padding-bottom: 10px;
}
.mt-0 {
  margin-top: 0;
}
p {
  font-size: 17px;
}
</style>
