<template>
  <q-dialog
    v-model="dialog"
    persistent
    :maximized=true
    transition-show="slide-up"
    transition-hide="slide-down"
  >
    <q-layout container>
      <q-header elevated class="bg-header">
        <q-toolbar>
          <img class="header-logo" src="../statics/logo_white.png" />
          <q-toolbar-title>Умови надання послуг</q-toolbar-title>
        </q-toolbar>
      </q-header>

      <q-page-container class="cnt bg-base">
        <q-page padding>
          <p>
            Увага! Перед переглядом цього сайту уважно прочитайте ці умови користування сайтом. Якщо ви не згодні з цими умовами користування сайтом, не використовуйте цей сайт.
          </p>
          <p class="h">
            Використання сайту
          </p>
          <p>
            Інтернет-сайт MyGarden дозволяє Вам переглядати матеріали цього інтернет-сайту (надалі по тексту «Сайт») лише для особистого некомерційного використання, за умови збереження Вами всієї інформації про авторське право та інших відомостей про право власності, що містяться у вихідних матеріалах і будь-яких їхніх копіях. Забороняється змінювати матеріали цього Сайту, а також поширювати або демонструвати їх в будь-якому вигляді або використовувати їх будь-яким іншим чином для суспільних або комерційних цілей. Будь-яке використання цих матеріалів на інших сайтах або в комп'ютерних мережах забороняється.
          </p>
          <p class="h">
            Відмова від відповідальності
          </p>
          <p>
            Матеріали і послуги цього Сайту надаються без будь-яких гарантій. MyGarden не гарантує точності і повноти матеріалів, програм і послуг, що надаються на цьому Сайті. MyGarden в будь-який час без повідомлення може вносити зміни в матеріали і послуги, що надаються на цьому Сайті, а також у згадані в них товари і ціни. У разі старіння матеріалів і послуг на цьому Сайті MyGarden не зобов'язана оновлювати їх. MyGarden ні за яких обставин не несе відповідальності за будь-які збитки (включаючи, але не обмежуючись збитком від втрати прибутку, даних або від переривання ділової активності), що виникли внаслідок використання, неможливості використання або результатів використання цього Сайту.
          </p>
          <p class="h">
            Реєстрація на Сайті
          </p>
          <p>
            Реєструючись на Сайті, Ви погоджуєтеся надати достовірну і точну інформацію про себе та свої контактні дані.
            В результаті реєстрації Ви отримуєте логін і пароль, за безпеку яких Ви особисто несете відповідальність. Ви також несете відповідальність за всі дії під Вашим логіном і паролем на Сайті. У разі втрати реєстраційних даних Ви зобов'язуєтеся повідомити нам про це.
          </p>
          <p class="h">
            Зворотній зв'язок і коментарі
          </p>
          <p>
            Звертаючись до нас або залишаючи коментарі на сайті, Ви несете відповідальність, що дане повідомлення не є незаконним, шкідливим, загрозливим, наклепницьким, ображає моральність, порушує авторські права, пропагує ненависть і / або дискримінацію людей за расовою, етнічною, статевою, релігійною, соціальною ознаками, містить образи на адресу конкретних осіб або організацій, а також будь-яким іншим чином порушує чинне законодавство України. Ви погоджуєтеся, що будь-яке ваше повідомлення MyGarden може видаляти без Вашої на те згоди, а також безоплатно використовувати на свій розсуд. MyGarden не несе відповідальності за будь-яку інформацію розміщену користувачами Сайту.
          </p>
          <p class="h">
            Використання персональних даних
          </p>
          <p>
            Ми використовуємо різні технології для збору і зберігання інформації, коли Ви відвідуєте Сайт MyGarden. Це може включати в себе запис одного або декількох кукі або анонімних ідентифікаторів. Ми також використовуємо кукі та анонімні ідентифікатори, коли Ви взаємодієте з послугами, запропонованими нашими партнерами, такими як рекламні послуги, наприклад, які можуть з'явитися на інших сайтах.
          </p>
          <br /><br />

          <q-page-scroller position="bottom-right" :scroll-offset="150" :offset="[18, 18]">
            <q-btn fab icon="keyboard_arrow_up" color="black" />
          </q-page-scroller>

          <q-page-scroller position="bottom-left" :scroll-offset="-1" :offset="[18, 18]">
            <q-card-actions align="right">
              <q-btn
                rounded
                color="green"
                text-color="black"
                class="action-btn"
                label="Прийняти"
                @click="accept"
              />
              <q-btn
                rounded
                color="white"
                text-color="black"
                class="action-btn"
                label="Відхилити"
                @click="decline"
              />
            </q-card-actions>
          </q-page-scroller>

        </q-page>
      </q-page-container>
    </q-layout>
  </q-dialog>
</template>

<script>
export default {
  props: {
    dialog: Boolean
  },
  methods: {
    accept () {
      this.$emit('close', true)
    },
    decline () {
      this.$emit('close', false)
    }
  }
}
</script>

<style scoped>
.header-logo {
  width: 32px;
  height: 32px;
  margin-top: 0px;
}
.action-btn {
  width: 120px;
}
.cnt {
  border:3px solid black;
  color:black
}
.bg-header {
  background: #000000;
}
.bg-base {
  background: #fff;
}
.h {
  font-size: 19px;
  padding-left: 10px;
  font-weight:600;
}
p {
  font-size: 17px;
}
</style>
